app/views/paginas/inicio.html.erb

SELECT "balanciamentos".* FROM "balanciamentos" WHERE (id_costumer = 1)
---
					<h5>Customer Nivel <%= customer.nivel %> (<%= customer.nome %>)</h5>
					<%Balanciamento.where('id_costumer = ?', customer.id).each do |balanceamento|%>

SELECT "balanciamentos".* FROM "balanciamentos" WHERE (id_costumer = 1)
SELECT  1 AS one FROM "balanciamentos" LIMIT ?  [["LIMIT", 1]]
SELECT  "balanciamentos".* FROM "balanciamentos" ORDER BY "balanciamentos"."id" DESC LIMIT ?  [["LIMIT", 1]]
---

				<%if Balanciamento.any?%>
					<%if Balanciamento.last.customer_mais_ocupado != 0%>

SELECT "clientes".* FROM "clientes" WHERE (tamanho != 0 AND tamanho >= 0 AND tamanho <= 50)
SELECT  "balanciamentos".* FROM "balanciamentos" ORDER BY "balanciamentos"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
							<div class="row">
								<h6>O Customer Success com mais clientes é o Nº <%= Balanciamento.last.customer_mais_ocupado.id %> - <%= Balanciamento.last.customer_mais_ocupado.nome %> (Nivel <%= Balanciamento.last.customer_mais_ocupado.nivel %>) com <%= Balanciamento.last.quantidade_de_clientes_customer_mais_ocupado %> clientes</h6>