app/controllers/clientes_controller.rb

INSERT INTO "clientes" ("nome", "tamanho", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["nome", "Cliente Teste"], ["tamanho", 40], ["created_at", "2022-07-10 23:05:57.166391"], ["updated_at", "2022-07-10 23:05:57.166391"]]
---
  def create
    @cliente = Cliente.new(cliente_params)

    respond_to do |format|
      if @cliente.save

UPDATE "clientes" SET "nome" = ?, "tamanho" = ?, "updated_at" = ? WHERE "clientes"."id" = ?  [["nome", "Cliente Teste 2"], ["tamanho", 20], ["updated_at", "2022-07-11 17:20:43.426501"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @cliente.update(cliente_params)