app/controllers/paginas_controller.rb

	def criar_balanciamento

		Balanciamento.destroy_all
		@customers_ativos = CustomerSuccess.where(status: 'ativo').order(:nivel)

		nivel_minimo = 0
		@customers_ativos.each do |customer|
			nivel_do_customer = customer.nivel
			clientes_para_esse_customer = Cliente.where('tamanho != 0 AND tamanho >= ? AND tamanho <= ?', nivel_minimo, nivel_do_customer)

			clientes_para_esse_customer.each do |cliente|
				balanceamento = ::Balanciamento.new(id_costumer: customer.id.to_i, id_cliente: cliente.id.to_i)
				balanceamento.save(validate: false)
			end
			nivel_minimo = nivel_do_customer + 1
		end

		@customers_ativos = CustomerSuccess.where(status: 'ativo')
		@customers_inativos = CustomerSuccess.where.not(status: 'ativo')
		@clientes = Cliente.all
---
DELETE FROM "balanciamentos" WHERE "balanciamentos"."id" = ?  [["id", 20]]
SELECT "clientes".* FROM "clientes" WHERE (tamanho != 0 AND tamanho >= 0 AND tamanho <= 50)
INSERT INTO "clientes" ("tamanho", "created_at", "updated_at") VALUES (?, ?, ?)  [["tamanho", 0], ["created_at", "2022-07-11 15:57:33.131825"], ["updated_at", "2022-07-11 15:57:33.131825"]]
INSERT INTO "balanciamentos" ("id_costumer", "id_cliente", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["id_costumer", 1], ["id_cliente", 1], ["created_at", "2022-07-11 18:56:24.297086"], ["updated_at", "2022-07-11 18:56:24.297086"]]