app/models/balanciamento.rb

SELECT DISTINCT "balanciamentos"."id_costumer" FROM "balanciamentos"
SELECT COUNT(*) FROM "balanciamentos" WHERE "balanciamentos"."id_costumer" = ?  [["id_costumer", 1]]
---
	def calculando_balanceamento
		calculo = []
		quantidade_max_de_clientes = 0
		customer_mais_ocupado = 0

		customers_ids = Balanciamento.distinct(:id_costumer).pluck(:id_costumer)
		customers = CustomerSuccess.where('id in (?)', customers_ids)

		customers.each do |customer|
			total_de_clientes_do_costumer = Balanciamento.where(id_costumer: customer.id).count